app/Http/Controllers/DataTable/CategoryController.php

    public function getcategoryParentOptions()
    {

          // get highest level Parents
        $v = Category::all('id','name');
---
select `id`, `name` from `categories`