app/Http/Controllers/DataTable/Daily_Emp_WorkController.php

    public function updateNote($id, Request $request){


        $dateEmpProduct = explode(' ',$id);
        $theDate = $dateEmpProduct[0];
        $theEmpId = $dateEmpProduct[1];
        $thePreProductId = $dateEmpProduct[2];

        // dd($theDate.$theEmpId.$thePreProductId);

        // dd($request->current_qty);
        // $updated_intermediate = $this->builder->find($id);

        // dd($updated_intermediate);
        $the_daily_emp_work = Daily_Emp_Work::where('date',$theDate)
                                -> where('user_id',$theEmpId)
                                -> where('intermediate_product_id',$thePreProductId)
                                ->update(['Note'=> $request->note]);
---
update `daily_emp_works` set `Note` = 'fdsa fdsafdsaf 123 45', `daily_emp_works`.`updated_at` = '2021-10-04 08:59:51' where `date` = '2021-07-26' and `user_id` = '16' and `intermediate_product_id` = '10'

    public function getUserOptions()
    {
        $r = User::all('id','name');
---
select `id`, `name` from `users`

    public function getRoleOptions()
    {
        $r = Role::all('id','name');
---
select `id`, `name` from `roles`

    public function getPermissionOptions()
    {
        $r = Permission::all('id','name');
---
select `id`, `name` from `permissions`