app/Http/Controllers/DataTable/Intermediate_ProductController.php

delete from `intermediate_products` where `id` = 24
---
        if ($the_intermediate_product->thumbnail){
            $result_thumbnail_array = explode('/',$the_intermediate_product->thumbnail);
            $old_thumbnail_name = $result_thumbnail_array[count($result_thumbnail_array)-1];
            Storage::delete([
            'public/intermediate_product_images/'. $old_thumbnail_name,
            ]);