app/Http/Controllers/DataTable/Invoices_From_SupplierController.php

select `id`, `name` from `users`
---
    public function getUserOptions()
    {
        $r = User::all('id','name');

select `id`, `name` from `suppliers`
---
    public function getSupplierOptions()
    {
        $c = Supplier::all('id','name');

select `id`, `supplier_invoice_number` from `invoices_from_suppliers`
---
    public function getInvoiceOptions()
    {
        $c = Invoices_From_Supplier::all('id','supplier_invoice_number');