app/Http/Controllers/DataTable/Invoice_From_Supplier_LineController.php

select `id`, `name` from `roles`
---
    public function getRoleOptions()
    {
        $r = Role::all('id','name');

select `id`, `name` from `permissions`
---
    public function getPermissionOptions()
    {
        $r = Permission::all('id','name');

select `id`, `name` from `goods_materials`
---
    public function getGoods_MaterialOptions()
    {
        $r = Goods_material::all('id','name');

select `id`, `name` from `suppliers`
---
    public function getSupplierOptions()
    {
        $c = Supplier::all('id','name');

select * from `order_to_supplier_lines` where `orders_to_supplier_id` = '42'
---
    public function getCategoryOptions($request)
    {
        // $request->orders_to_supplierId
        // dd($request->order_to_supplierId);
        $oders_to_supplier_lines = Order_To_Supplier_Line::where('orders_to_supplier_id','=',$request->orders_to_supplierId)->get();

select `id`, `name` from `categories`
---
    public function getAllCategoryOptions()
    {
        $c = Category::all('id','name');

select `id`, `name` from `units`
---
    public function getUnitOptions()
    {
        $c = Unit::all('id','name');