app/Http/Controllers/DataTable/Orders_To_SupplierController.php

select * from `invoices_from_suppliers` where `invoices_from_suppliers`.`orders_to_supplier_id` in (33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 55, 56, 57)
---
    protected function getRecords(Request $request)
    {
        $builder = $this->builder->with(['invoices_from_supplier']);

        if ($this->hasSearchQuery($request)) {
            $builder = $this->buildSearch($builder, $request);
        }

        if ($this->hasSearchQuery_1($request)) {
            $builder = $this->buildSearch_1($builder, $request);
        }

        if (isset($request->user)) {
            $builder =   $builder->where('user','=',$request->user);
        }
        if (isset($request->supplier)) {
            $builder =   $builder->where('supplier','=',$request->supplier);
        }
        if (isset($request->orders_to_supplierId)) {
            $builder =   $builder->where('id','=',$request->orders_to_supplierId);
        }

        // dd($builder);

        try {
            return Orders_To_SupplierResourceDB::collection(
                $builder
                ->limit($request->limit)
                ->orderBy('id', 'asc')
                ->get($this->getRetrievedColumns())
            );

select `id`, `name` from `users`
---
    public function getUserOptions()
    {
        $r = User::all('id','name');

select `id`, `name` from `suppliers`
---
    public function getSupplierOptions()
    {
        $c = Supplier::all('id','name');