app/Http/Controllers/DataTable/RoleController.php

select `id`, `name` from `permissions`
---
    public function getPermissionOptions()
    {
        $r = Permission::all('id','name');