app/Http/Controllers/DataTable/UserController.php

    public function getRoleOptions()
    {
        $r = Role::all('id','name');
---
select `id`, `name` from `roles`

    public function getPermissionOptions()
    {
        $r = Permission::all('id','name');
---
select `id`, `name` from `permissions`