app/Models/User.php

    public function getPermissions()
    {
        $allPermissionsOfUser = [];

         // get all permissions from the role of user

        foreach ($this->roles as $role) {
            $permissionsOfTheRole = $role->permissions->map->only(['id', 'name']);
            // return var_dump(json_decode(json_encode($permissionsOfTheRole,true)));
            // $permissionsOfTheRorleArray =  json_decode(json_encode($permissionsOfTheRole,true));
            // array_merge($allPermissionsOfTheRole,$myArray);
            $included = true;
            // get all permissions from the role of user
            foreach($permissionsOfTheRole as $theConsideredPermission) {
                //test if the consider permission is alredy in
                foreach($allPermissionsOfUser as $thePermission){
                    if($theConsideredPermission['id'] == $thePermission['id']){
                        $included = false;
                    }
                }
                if($included) {
                    array_push($allPermissionsOfUser,$theConsideredPermission);
                }
            }
        }


        // get all permissions from the the pivot table of user_permission
        $user_permissions = $this->permissions->map->only(['id', 'name']);
---
select `permissions`.*, `roles_permissions`.`role_id` as `pivot_role_id`, `roles_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles_permissions`.`role_id` = 1
select `permissions`.*, `users_permissions`.`user_id` as `pivot_user_id`, `users_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `users_permissions` on `permissions`.`id` = `users_permissions`.`permission_id` where `users_permissions`.`user_id` = 16

    public function getIntermediateProducts()
    {
         // get all roles of the user from pivot table user_role
         $user_roles = $this->roles;
         // get all permissions of the user from pivot table user_permission
         $user_permissions = $this->permissions;

         $userPermissionId =[];

         $returnArr = [];

          // get all permissions from the role of user
        foreach($user_roles as $role){
            foreach($role->permissions as $permission){
                // $userPermission[$permission->id] = $permission->name;
                array_push($userPermissionId,$permission->id);
            }
        }

         // get all permissions from the the pivot table of user_permission
         foreach($user_permissions as $permission)
         {
             if(!in_array($permission->id,$userPermissionId))
             array_push($userPermissionId,$permission->id);
         }

         // foreach($user_roles as $role){
             $r = Intermediate_Product::select('id','name','required_qty')
             ->whereIn('Preparation',['Yes','OnGoing'])
             ->where('active',1)
             ->whereIn('permission_id',$userPermissionId)
             ->get();
---
select `id`, `name`, `required_qty` from `intermediate_products` where `Preparation` in ('Yes', 'OnGoing') and `active` = 1 and `permission_id` in (1, 2, 3, 4, 5, 9, 11, 1, 1, 2, 3, 4, 5)